---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsBoolean
source: html/e185ce4a-927b-49b9-30c4-c1c8d7748072.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsBoolean Method

Gets storage value as boolean when its PrimitiveType is boolean.

## Syntax (C#)
```csharp
public bool AsBoolean()
```

## Returns
The bool value.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not boolean.